[LanguageDefinition]

LanguageID = English

Title = "Digital Wizard's Lab world editor v"

B_AddLayer = "Add layer"

I_Pivot = "Pivot"
I_Oval = "Oval"
I_Rectangle = "Rectangle"
I_Ray = "Ray"
I_TopLeftTriangle = "Top-left triangle"
I_TopRightTriangle = "Top-right triangle"
I_BottomLeftTriangle = "Bottom-left triangle"
I_BottomRightTriangle = "Bottom-right triangle"
I_Raster = "Raster"
I_Null = "Null"

L_X = "X:"
L_Y = "Y:"
L_Width = "Width:"
L_Height = "Height:"
L_DX = "DX:"
L_DY = "DY:"
L_Shape = "Shape:"
L_Velocity = "Velocity:"
L_Angle = "Angle:"
L_DisplayingAngle = "Disp. angle:"
L_CollLayer = "CollLayer:"
L_Alpha = "Alpha:"
L_Red = "Red:"
L_Green = "Green:"
L_Blue = "Blue:"
L_XScale = "XScale:"
L_YScale = "YScale:"
L_VisDX = "VisualDX:"
L_VisDY = "VisualDY:"
L_Frame = "Frame:"
B_SelectImage = "Image"
B_SelCol = "Color"
CB_Rotation = "Rotation"
CB_Scaling = "Scaling"
CB_Physics = "Physics"
L_ImageAngle = "Image angle:"

M_File = "File"
M_New = "New project"
M_Open = "Open project..."
M_Save = "Save project..."
M_SaveAs = "Save project as..."
M_Merge = "Merge project with..."
M_Exit = "Exit"
M_Edit = "Edit"
M_SnapToGrid = "Snap to grid"
M_GridSettings = "Grid settings"
M_BackgroundColor = "Select background color"
M_TileMapEditingMode = "Tilemap editing mode"
M_ReplacementOfTiles = "Replacement of tiles"
M_ProlongTiles = "Prolong tiles"
M_CameraProperties = "Camera properties"
M_Incbin = "Automatically generate file with incbin's"

M_View = "View"
M_ShowCollisions = "Show collision shapes"
M_ShowVectors = "Show vectors"
M_ShowNames = "Show names"
M_ShowGrid = "Show grid"
M_BilinearFiltering = "Bilinear filtering"

M_StartSimulation = "Start simulation"
N_SetBounds = "You should set bounds of the layer to start simulation"
W_Simulation = "Physics simulation of layer"

M_Language = "Language"
M_English = "English"
M_Russian = "Russian"

M_Help = "Help"
M_HotKeys = "Hot keys list"
M_About = "About"

M_SelectViewLayer = "Select for view"
M_SelectContainer = "Select for inserting sprites"
M_AddLayer = "Add new layer"
M_AddTilemap = "Add new tilemap"
M_AddSpriteMap = "Add new sprite map"
M_Import = "Import"
M_ImportTilemap = "Import tilemap"
M_ImportTilemaps = "Import tilemaps"
M_EditBounds = "Edit bounds"
M_RemoveBounds = "Remove bounds"
M_MixContent = "Mix content"
M_EditTilemap = "Edit"
M_SelectTilemap = "Select as sprite"
M_ToggleVisibility = "Toggle visibility (V)"
M_ToggleActivity = "Toggle activity (A)"
M_Cut = "Cut"
M_Copy = "Copy"
M_Paste = "Paste"
M_ResizeTileMap = "Resize"
M_SelectTileset = "Select tileset"
M_EditTileCollisionShapes = "Edit tile collision shapes"
M_EditTileReplacementRules = "Edit tile replacement rules"
M_Enframe = "Enframe"
M_GenerateRules = "Generate rules"
M_Areas = "For areas"
M_Walls = "For walls"
M_TilemapProperties = "Tilemap properties"
M_SetBounds = "Set as bounds of current layer"
M_Duplicate = "Duplicate"
M_Rename = "Rename"
M_SetClass = "Set class"
M_ShiftToTheTop = "Shift to the top (Home)"
M_ShiftUp = "Shift up (PgUp)"
M_ShiftDown = "Shift down (PgDn)"
M_ShiftToTheBottom = "Shift to the bottom (End)"
M_Remove = "Remove"

M_SpriteMapProperties = "Properties"
N_CannotInsertNonSpriteToSpriteMap = "It's impossible to insert non-sprite into sprite map"

D_UnsavedWorld = "Your world is not saved, would you like to save it now?"
D_SelectFileNameToSave = "Select world file name to save..."
D_SelectFileNameToOpen = "Select world file name to open..."
D_SelectFileNameToMerge = "Select world file name to merge with..."

D_EnterNameOfObject = "Enter name of the object:"
D_EnterClassNameOfObject = "Enter name of the object's class:"
D_EnterNameOfLayer = "Enter name of the new layer:"
D_EnterNameOfTilemap = "Enter name of the new tilemap:"
D_EnterNameOfTileset = "Enter name of the new tileset:"
D_EnterNameOfSpriteMap = "Enter name of the new sprite map:"

W_SelectTileSet = "Select tileset for tilemap"
D_SelectTilemapFile = "Select tilemap file to process..."
D_SelectTilemapsDirectory = "Select directory with tilemap files to process..."
D_SelectFileToSaveImageTo = "Select file to save tiles image to..."
N_CannotLoadImage = "Cannot load image."
N_TilemapSize = "Tilemap size should be divideable by tile size."

W_ChooseTileSize = "Choose tile size"
L_WidthInPixels = "Width in pixels:"
L_HeightInPixels = "Height in pixels:"

W_ChooseTilemapSize = "Choose tilemap size"
L_WidthInTiles = "Width in tiles:"
L_HeightInTiles = "Height in tiles:"

W_SpriteMapProperties = "Sprite map properties"
D_EnterCellSize = "Enter cell size:"
L_HorizontalCells = "Horizontal cells quantity:"
L_VerticalCells = "Vertical cells quantity:"
L_LeftMargin = "Left margin"
L_TopMargin = "Top margin"
L_RightMargin = "Right margin"
L_BottomMargin = "Bottom margin"
L_InitialArraysSize = "Initial cell array-list size:"
L_Sorted = "Sorted by Y-coordinate"
L_PivotMode = "Pivot mode"
N_CellSizeMoreThanZero = "Cell size should be more than 0"
N_ArraySizeMoreThanZero = "Array size should be more than 0"

N_ParametersMustBeMoreThanZero = "Parameters should be more than 0"

W_CameraProperties = "Camera properites"
L_Isometric = "Isometric"
L_X1 = "X1:"
L_Y1 = "Y1:"
L_X2 = "X2:"
L_Y2 = "Y2:"
N_VectorsAreParallel = "Vectors should not be parallel"

B_OK = "OK"
B_Cancel = "Cancel"

W_TilesetRulesEditor = "Tileset replacement rules editor"
L_SelectTileset = "Select tileset for tilemap first"
L_SelectImage = "Select image for tileset first"
B_AddCategory = "Add category"
M_RenameCategory = "Rename"
M_CopyCategory = "Copy"
M_RemoveCategory = "Remove"
M_AddTileRule = "Add tile rule"
M_RemoveTileRule = "Remove"
M_ShiftTileRuleUp = "Shift up (PgUp)"
M_ShiftTileRuleDown = "Shift down (PgDown)"
L_XDivider = "XDivider:"
L_YDivider = "YDivider:"
D_EnterTileShift = "Enter tile shift"
D_EnterNameOfNewCategory = "Enter name of the new category"
D_EnterNameOfCategory = "Enter name of category"

W_ImageProperties = "Image properties"
B_ReloadImage = "Reload image"
D_SelectImage = "Select image... "
L_LeftBorder = "Left border"
L_TopBorder = "Top border"
L_RightBorder = "Right border"
L_BottomBorder = "Bottom border"
N_ImageDivideable = "Image sizes must be divideable by tile cells quantity"
N_TileCellsQuantityMoreThanZero = "Tile cells quantity must be more than 0"

W_SelectSpriteImage = "Select image for sprite"
W_SelectTilesetImage = "Select image for tileset"
W_SelectTilemapTileset = "Select tileset for tilemap"
L_Image = "Image:"
L_Tileset = "Tileset:"
B_Add = "Add"
B_AddImage = "Add image"
B_AddFrame = "Add frame"
B_RenameTileset = "Rename"
B_Modify = "Modify"
B_Remove = "Remove"
D_TilemapDataLoss = "Some of tilemap data may be lost, are you sure you want to continue?"
D_TilesetDataLoss = "Some of tileset data may be lost, are you sure you want to continue?"
D_TilemapsDataLoss = "Some data of tilemaps with this tileset may be lost, are you sure you want to continue?"
D_ImageInUse = "This image is used by other objects, do you really want to delete it?"
D_TilesetInUse = "This tilesets is used by tilemap(s), do you really want to delete it?"
N_LessThanZero = "Some border values are less than zero."
N_BordersAreTooLarge = "Borders leave no space for central area."
L_Proportional = "Proportional edges drawing"

W_GridSettings = "Grid settings"
L_PositionSnapping = "Positioning snapping mode:"
L_ResizingSnapping = "Resizing snapping mode:"
I_EdgeSnap = "Snap edges"
I_CenterSnap = "Snap center"
I_FixedMovement = "Fixed movement step"
I_SizeSnap = "Snap size"
I_FixedResize = "Fixed resizing step"
L_CellWidth = "Cell width:"
L_CellHeight = "Cell height:"
L_HorizontalCellDivision = "Horizontal cell division:"
L_VerticalCellDivision = "Vertical cell division:"
L_GridActive = "Snap to grid"
B_SelectColor = "Select color"
W_EnterAlpha = "Enter alpha value"
N_CellDivisionsMore = "Cell divisions should be more than 0"
N_CellSizesMore = "Cell width and height should be more than 0"

W_ResizeTilemap = "Change tilemap size"
L_HorizontalShift = "Horizontal shift:"
L_VerticalShift = "Vertical shift:"
L_BlueTileMap = "Blue rectangle - current tilemap size"
L_RedTileMap = "Red rectangle - new tilemap size"

W_TileCollisionShapesEditor = "Tile collision shapes editor"
L_CollisionLayer = "Collision layer:"
B_Close = "Close"

D_AreYouSure = "Are you sure you want to clear tilemap?"

W_TileMapProperties = "Tilemap properties"
L_HorizontalOrder = "Column displaying order"
L_VerticalOrder = "Row displaying order"
L_Wrapped = "Wrapped"
I_LeftToRight = "Left to right"
I_RightToLeft = "Right to left"
I_TopToBottom = "Top to bottom"
I_BottomToTop = "Bottom to top"

H_HotKeys = "Main window:|Arrow keys, Ctlr  - pan tilemap|Num+, Num- - alter magnification|D - duplicate objects|H - correct sprites height depending on image size and sprite width|S - direct sprites to the cursor|T - set class of selected sprites|N - set name of selected sprites|A - toggle activity of objects|V - toggle visibility of objects|F - change facing of selected sprites|G - group sprites into template|U - ungroup sprites|R - change tiles in tile map|Home - move objects to the back|PgUp - move objects back|PgDown - move objects foward|End - move objects to the front|Del - remove objects||Tileset window:|F - fill tilemap with tile under cursor|E - select empty tile|Num0 - set block size of selected tile"
H_About1 = "Digital Wizard's Lab framework World Editor||Version "
H_About2 = "||http://code.google.com/p/dwlab"

M_ModifyParameter = "Modify"
M_RemoveParameter = "Remove"
L_ParameterName = "Name:"
L_ParameterValue = "Value:"
W_ParameterProerties = "Parameter properties"

N_AddNewLayer = "Add new layer"
N_AddNewParameter = "(Add new parameter)"